firt_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        lists = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Eren Jager"], ["email", "titankiller@email.com"], ["created_at", "2021-02-03 22:37:03.070441"], ["updated_at", "2021-02-03 22:37:03.070441"]]
---
   def create
    user = User.new(params.require(:user).permit(:name,:email))
    user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        person = User.find(params[:id])